views/layouts/header.php

                                 alt="User Image"/>
                            <p class="admin_name_display">
                                <?php
                                    $loginDetails = LoginDetails::find()->where(['login_ip_address'=>LoginDetails::get_ip_address(),'login_user_id'=>Yii::$app->user->getId(),'login_status'=>1])->orderBy('login_detail_id DESC')->one();
---
SELECT * FROM `coe_login_details` WHERE (`login_ip_address`='127.0.0.1') AND (`login_user_id`=1) AND (`login_status`=1) ORDER BY `login_detail_id` DESC