components/ConfigUtilities.php

SELECT * FROM `coe_configuration` WHERE `config_name`='coe.degree.name'
---
  public  function getConfigValue($name)
    {
        $config_value = Configuration::find(['config_desc'])->where(['config_name' => $name])->one();

SELECT * FROM `coe_configuration` WHERE `config_name`='coe.nominal.enable.status'
---
    public function getConfigDesc($name)
    {
        $config_value = Configuration::find(['config_desc'])->where(['config_name' => $name])->one();

SELECT * FROM `coe_batch` ORDER BY `batch_name`
---
    public function getBatchDetails()
    {
        $batch = Batch::find()->orderBy(['batch_name'=>SORT_DESC])->all();