views/site/user-dashboard.php

SELECT COUNT(*) FROM `user`
---
                                    <?php echo "NO OF ".ConfigUtilities::getConfigValue(ConfigConstants::CONFIG_USER); ?>
                                </div>
                                <div class="circle-tile-number text-faded">
                                    <?php echo User::find()->count(); ?>

SELECT COUNT(*) FROM `coe_degree`
---
                                    <?php echo "NO OF ".ConfigUtilities::getConfigValue(ConfigConstants::CONFIG_DEGREE); ?>
                                </div>
                                <div class="circle-tile-number text-faded">
                                    <?php echo Degree::find()->count(); ?>

SELECT COUNT(*) FROM `coe_batch`
---
                                    <?php echo "NO OF ".ConfigUtilities::getConfigValue(ConfigConstants::CONFIG_BATCH); ?>
                                </div>
                                <div class="circle-tile-number text-faded">
                                    <?php echo Batch::find()->count(); ?>

SELECT COUNT(*) FROM `coe_programme`
---
                                    <?php echo "NO OF ".ConfigUtilities::getConfigValue(ConfigConstants::CONFIG_PROGRAMME); ?>
                                </div>
                                <div class="circle-tile-number text-faded">
                                    <?php echo Programme::find()->count(); ?>

SELECT COUNT(*) FROM `coe_student` WHERE `student_status`='Active'
---
                                    <?php echo "NO OF ".ConfigUtilities::getConfigValue(ConfigConstants::CONFIG_STUDENT); ?>
                                </div>
                                <div class="circle-tile-number text-faded">
                                    <?php echo Student::find()->where(['student_status'=>'Active'])->count() ?>