models/ExamTimetable.php

SELECT * FROM `coe_categories` WHERE `category_name`='Exam Type'
SELECT * FROM `coe_category_type` WHERE `category_id`=7
---
    public function getExamType()
    {
        $exam = ConfigUtilities::getConfigDesc(ConfigConstants::CONFIG_EXAM_TYPE);
        $config_list = Categories::find()->where(['category_name' => $exam])->one();
        $c_id = $config_list['coe_category_id'];

        $config_list = Categorytype::find()->where(['category_id' => $c_id])->all();